Catalogs/Спортсмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Спортсмены</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РезультатыИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>РезультатыИзмерений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыОрганизма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Спортсмены/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Возраст =  ВозрастВычислить(ТекущаяДата(),Объект.ФизЛицо.ДатаРождения);
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыИзмеренийСрезПоследних.Период,
		|	РезультатыИзмеренийСрезПоследних.Регистратор,
		|	РезультатыИзмеренийСрезПоследних.НомерСтроки,
		|	РезультатыИзмеренийСрезПоследних.Активность,
		|	РезультатыИзмеренийСрезПоследних.Спортсмен,
		|	РезультатыИзмеренийСрезПоследних.Параметр КАК Параметр,
		|	РезультатыИзмеренийСрезПоследних.ЗначениеПараметра,
		|	РезультатыИзмеренийСрезПоследних.Параметр.Основной КАК Основной
		|ИЗ
		|	РегистрСведений.РезультатыИзмерений.СрезПоследних(&ДатаЗапроса, Спортсмен = &Ссылка) КАК РезультатыИзмеренийСрезПоследних
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Параметр)
		|ПО
		|	Основной";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяДата());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		КоличествоВПервойКолонке = Окр(Выборка.Параметр/2,0);
		ЕСли Выборка.Основной Тогда
			ИмяГруппы = "Основные";
		Иначе
			ИмяГруппы = "Дополнительные";
		КонецЕсли;

		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		н=1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//Если н<=КоличествоВПервойКолонке Тогда
			//	НомерКолонки = 1;
			//Иначе
			//	НомерКолонки = 2;
			//КонецЕсли;
			НомерКолонки = 1;

			ЭлементОтображенияДанных = ЭтаФорма.Элементы.Добавить(СтрЗаменить(ВыборкаДетальныеЗаписи.Параметр.Наименование," ",""),Тип("ДекорацияФормы"), Элементы[ИмяГруппы+"Колонка"+НомерКолонки]);
			ЭлементОтображенияДанных.Вид = ВидДекорацииФормы.Надпись;
			
			ЭлементОтображенияДанных.Заголовок = ВыборкаДетальныеЗаписи.Параметр.Наименование+": "+ВыборкаДетальныеЗаписи.ЗначениеПараметра+" "+ВыборкаДетальныеЗаписи.Параметр.ЕдиницаИзмерения+"  (на "+Формат(ВыборкаДетальныеЗаписи.Период,"ДЛФ=DD")+")";
			
			//ЭлементОтображенияДанных.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			//ЭлементОтображенияДанных.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			//ЭлементОтображенияДанных.Шрифт = Новый Шрифт(ЭлементОтображенияДанных.Шрифт,,,Истина); 
			н=н+1;
		КонецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры


 Функция ВозрастВычислить(Возраст,Дата)
	
	Месяцы = РазностьМеждуДатамиВМесяцах(Возраст,Дата);
	ВозрастСтруктура = ВозрастВМесяцахИГодах(Месяцы);
	ВозрастПрописью = ВозрастПрописью(ВозрастСтруктура);
	
	Возврат ВозрастПрописью;
	
КонецФункции

 Функция РазностьМеждуДатамиВМесяцах(Дата1,Дата2)
	
	Год1 = Год(Дата1);
	Год2 = Год(Дата2);
	Месяц1 = Месяц(Дата1);
	Месяц2 = Месяц(Дата2);
	День1 = День(Дата1);
	День2 = День(Дата2);
	
	Результат = (Год1 - Год2) * 12 + Месяц1 - Месяц2;
	Если Результат < 0 Тогда Результат = 0 - Результат; КонецЕсли;
	Если ((Дата1 > Дата2) И (День1 < День2)) ИЛИ ((Дата1 < Дата2) И (День1 > День2)) Тогда
		Результат = Результат - 1;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции   

 Функция ВозрастВМесяцахИГодах(Месяцы)
	
	Структура = Новый Структура;
	Структура.Вставить("Год");
	Структура.Вставить("Месяц");
	Структура.Месяц = Месяцы % 12;
	Структура.Год = (Месяцы - Структура.Месяц) / 12;
	
	Возврат Структура;
	
КонецФункции   

 Функция ВозрастПрописью(Структура)
	
	Строка = "";
	Если Структура.Год > 0 Тогда
		ПоследняяЦифраГода = Число(Сред(Строка(Структура.Год), СтрДлина(Строка(Структура.Год)), 1));
		Если (ПоследняяЦифраГода = 1) И (Структура.Год <> 11) Тогда Строка = Строка(Структура.Год) + " год"; КонецЕсли;
		Если (ПоследняяЦифраГода >= 2) И (ПоследняяЦифраГода <=4) И ((Структура.Год < 12) ИЛИ (Структура.Год > 14)) Тогда Строка = Строка(Структура.Год) + " года"; КонецЕсли;
		Если ((ПоследняяЦифраГода >= 5) И (ПоследняяЦифраГода <=9)) ИЛИ (ПоследняяЦифраГода = 0) Тогда Строка = Строка(Структура.Год) + " лет"; КонецЕсли;
		Если (Структура.Год >= 11) И (Структура.Год <= 14) Тогда Строка = Строка(Структура.Год) + " лет"; КонецЕсли;
	КонецЕсли;
	
	Если (Структура.Год > 0) И (Структура.Год < 3) И (Структура.Месяц > 0) Тогда
		Строка = Строка + ", ";
	КонецЕсли;
	
	Если (Структура.Месяц > 0) И (Структура.Год <= 3) Тогда
		Если Структура.Месяц = 1 Тогда Строка = Строка + "1 месяц"; КонецЕсли;
		Если (Структура.Месяц >= 2) И (Структура.Месяц <= 4) Тогда Строка = Строка + Строка(Структура.Месяц) + " месяца"; КонецЕсли;
		Если Структура.Месяц >= 5 Тогда Строка = Строка + Строка(Структура.Месяц) + " месяцев"; КонецЕсли;
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции
